<template>
  <div class="home pa-8">
    <p>メニューの中のピクトリンクから部屋を探してね！</p>
    <p>
      砂場メニューではペンの太さや色の変更、一人モードでお絵かきができるよ！
    </p>
    <p>
      改善要望、修正依頼、機能追加要望等は
      <a href="https://github.com/YutaUra/drawing/issues">
        こちら
      </a>
      からお願いします！是非お待ちしてます！PR(プルリク、紹介)も大歓迎です！
    </p>
    <br />
    <code class="pa-2">
      <p>プライバシーポリシー的な</p>
      <p>
        ユーザー情報としてメールアドレスとニックネームを保持しています。それらは堅牢なシステムで保護されているわけではなく、ハッカーによって読み取れる可能性があります。
      </p>
      <p>
        また、作成する部屋には鍵機能がありますが、こちらも必ずしもプライバシーを保証できる物ではありません。個人情報等は記載しない。描かないようにしてください。
      </p>
      <p>以上を踏まえてどうぞお楽しみください！</p>
    </code>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'

export default Vue.extend({
  name: 'home'
})
</script>
